Benchmarks/complain_complainaudit_enforce/media-streaming/parser_output/output_run_6/result1.log

Total: connections 410 requests 6943 replies 6943 test-duration 330.214 s
Number of connected connections is currently = 0

Connection rate: 1.2 conn/s (805.4 ms/conn, <=410 concurrent connections)
Connected connection rate: 1.2 conn/s (805.4 ms/conn, <=410 concurrent connected connections)
Connection time [ms]: min 30010.9 avg 129446.1 max 320594.9 median 99999.5 stddev 101286.4
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 16.934

Response time (no timeouts) [ms]: 0.0
Response time (only timeouts) [ms]: 0.0
Response time (all) [ms]: 129446.1
Request rate: 21.0 req/s (47.6 ms/req)
Request size [B]: 139.0

Overall reply rate: 21.0 replies/sec
Reply rate [replies/s]: min 7.6 avg 21.0 max 164.0 stddev 27.9 (66 samples)
Reply time [ms]: response 1.2 transfer 4.4
Reply size [B]: header 294.0 content 3037756.0 footer 0.0 (total 3038050.0)
Reply status: 1xx=0 2xx=6943 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.63 system 27.33 (user 0.5% system 8.3% total 8.8%)
Net I/O: 62383.1 KB/s (511.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 addrinuse 0 other 0
Unconnected timeouts 0 connected timeouts 0 total (0) client_timeouts 0


Session rate [sess/s]: min 0.00 avg 1.24 max 8.60 stddev 2.95 (410/410)
Session: avg 1.00 connections/session
Session lifetime [s]: 129.4
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 0 0 0 84 0 0 80 0 0 0 0 83 0 82 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 81